cljsapp-solution/slides/cljs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ClojureScript</title>
<!-- 2013-12-10 Di 13:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Adrian Bendel" />
<link rel="stylesheet" type="text/css" href="common.css" />
<link rel="stylesheet" type="text/css" href="screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="presenter.css" media="presenter" />
</head>
<body>
<div id="content">
<h1 class="title">ClojureScript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">ClojureScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-2">Introduction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-3">Why ClojureScript?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-4">Implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-5">Clojure in Clojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-6">Google Closure Compiler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-7">Google Closure Compiler (whitespace)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-8">Google Closure Compiler (simple)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-9">Google Closure Compiler (advanced)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-10">Google Closure Compiler &amp; Ecosystem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-11">Differences from Clojure (1)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-12">Differences from Clojure (2)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-13">Build-Tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-14">REPL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-15">Debugging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-16">Ecosystem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
<li><a href="#sec-17">Thanks!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ClojureScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">
<center>
<p>Clojure User Group Bonn
<p>
<p>10.12.2013
<p>
<p>Adrian Bendel
</center>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Introduction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>ClojureScript is Clojure, compiled to JavaScript
</li>
<li>Introduced 20.07.2011 by Rich Hickey
</li>
<li>Now about 2100 commits by 66 contributors
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Why ClojureScript?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Reach
<ul class="org-ul">
<li>Browser
</li>
<li>Smartphones
</li>
<li>Also: Server
</li>
</ul>
</li>
<li></li>
<li><a href="http://www.hanselman.com/blog/JavaScriptIsAssemblyLanguageForTheWebSematicMarkupIsDeadCleanVsMachinecodedHTML.aspx">JavaScript is Assembly Language for the Web (Scott Hanselman)</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Compiler in Clojure
</li>
<li>Macros in Clojure
</li>
<li>Standard library in ClojureScript
</li>
<li>Google Closure Compiler
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Clojure in Clojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Clojure compiler in Java
</li>
<li>ClojureScript compiler in Clojure
<ul class="org-ul">
<li>No Javascript source files
</li>
<li>Abstractions are protocols
</li>
<li>Data structures implemented with deftype
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Google Closure Compiler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Conventions on how JavaScript needs to be written
</li>
<li>Code can be optimized
</li>
<li>ClojureScript compiler emits Closure compatible code
<ul class="org-ul">
<li>namespaces map to Closures dependency mechanism
</li>
</ul>
</li>
<li>Used for most of Googles JavaScript
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Google Closure Compiler (whitespace)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">alertSum</span>(<span style="color: #D8FA3C;">number1</span>, <span style="color: #D8FA3C;">number2</span>) {
  <span style="color: #FBDE2D;">var</span> <span style="color: #D8FA3C;">sum</span> = number1 + number2;
  alert(<span style="color: #61CE3C;">"The sum of "</span> + number1 + <span style="color: #61CE3C;">" and "</span> + number2 + <span style="color: #61CE3C;">" is "</span> + sum);
}
alertSum(7,7);
</pre>
</div>
<p>
Compiled:
</p>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">alertSum</span>(<span style="color: #D8FA3C;">number1</span>,<span style="color: #D8FA3C;">number2</span>){<span style="color: #FBDE2D;">var</span> <span style="color: #D8FA3C;">sum</span>=number1+number2;alert(<span style="color: #61CE3C;">"The sum of "</span>+number1+<span style="color: #61CE3C;">" and "</span>+number2+<span style="color: #61CE3C;">" is "</span>+sum)}alertSum(7,7);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Google Closure Compiler (simple)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">alertSum</span>(<span style="color: #D8FA3C;">number1</span>, <span style="color: #D8FA3C;">number2</span>) {
  <span style="color: #FBDE2D;">var</span> <span style="color: #D8FA3C;">sum</span> = number1 + number2;
  alert(<span style="color: #61CE3C;">"The sum of "</span> + number1 + <span style="color: #61CE3C;">" and "</span> + number2 + <span style="color: #61CE3C;">" is "</span> + sum);
}
alertSum(7,7);
</pre>
</div>
<p>
Compiled:
</p>
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">alertSum</span>(<span style="color: #D8FA3C;">a</span>,<span style="color: #D8FA3C;">b</span>){alert(<span style="color: #61CE3C;">"The sum of "</span>+a+<span style="color: #61CE3C;">" and "</span>+b+<span style="color: #61CE3C;">" is "</span>+(a+b))}alertSum(7,7);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Google Closure Compiler (advanced)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #FBDE2D;">function</span> <span style="color: #ff1493;">alertSum</span>(<span style="color: #D8FA3C;">number1</span>, <span style="color: #D8FA3C;">number2</span>) {
  <span style="color: #FBDE2D;">var</span> <span style="color: #D8FA3C;">sum</span> = number1 + number2;
  alert(<span style="color: #61CE3C;">"The sum of "</span> + number1 + <span style="color: #61CE3C;">" and "</span> + number2 + <span style="color: #61CE3C;">" is "</span> + sum);
}
alertSum(7,7);
</pre>
</div>
<p>
Compiled:
</p>
<div class="org-src-container">

<pre class="src src-javascript">alert(<span style="color: #61CE3C;">"The sum of 7 and 7 is 14"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Google Closure Compiler &amp; Ecosystem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Benefits
<ul class="org-ul">
<li>Code optimization &amp; minification
</li>
<li>Dead code elimination
</li>
<li>Closure libraries are huge
</li>
</ul>
</li>
<li><a href="http://lukevanderhart.com/2011/09/30/using-javascript-and-clojurescript.html">Needs some build configuration for unsupported libraries</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Differences from Clojure (1)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Global <code>js</code>-namespace
</li>
<li>Macros
<ul class="org-ul">
<li>Implement in <code>.clj</code>-Files, load with <code>:require-macros</code>
</li>
</ul>
</li>
<li>Reference Types: Only atom
</li>
<li>No eval and runtime compilation
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Differences from Clojure (2)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>No Vars, namespaces at runtime
</li>
<li><code>def</code> and <code>binding</code> as in Clojure, but on JS variables
</li>
<li>Numbers (just JavaScript numbers)
</li>
<li><a href="https://github.com/clojure/clojurescript/wiki/Differences-from-Clojure">Some more</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Build-Tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li><a href="https://github.com/technomancy/leiningen">leiningen</a>
<ul class="org-ul">
<li>ClojureScript libraries distributed as jars
</li>
</ul>
</li>
<li><a href="https://github.com/emezeske/lein-cljsbuild">lein-cljsbuild</a>
</li>
<li><a href="https://github.com/lynaghk/cljx">cljx</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">REPL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Browser-REPL
<ul class="org-ul">
<li><a href="https://github.com/cemerick/austin">https://github.com/cemerick/austin</a>
</li>
</ul>
</li>
<li>Headless REPL on Rhino
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">Debugging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Source map support just added
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Ecosystem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li><a href="https://github.com/cemerick/clojurescript.test">clojurescript.test</a>
</li>
<li><a href="https://github.com/clojure/core.async">core.async</a>
</li>
<li><a href="https://github.com/levand/domina">domina</a>
</li>
<li><a href="https://github.com/Prismatic/dommy">dommy</a>
</li>
<li>&#x2026;
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Thanks!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-17">
<center>
<p>Questions?
<p>
<p>Sources
</center>
<ul class="org-ul">
<li><a href="https://github.com/clojure/clojurescript/wiki">ClojureScript Wiki</a>
</li>
<li><a href="http://cloud.github.com/downloads/clojure/clojurescript/clojurescript%2520slides.pdf">Rich's slides</a>
</li>
<li><a href="http://www.youtube.com/watch?v%3DEpcNDd8nuYY">Clojure/ClojureScript: One Language to Rule the Web</a>
</li>
<li><a href="https://developers.google.com/closure/">Closure Tools</a>
</li>
</ul>
<center>
<p>Slides built with:
<p>
<a href="http://www.gnu.org/software/emacs/">Emacs</a> - <a href="https://github.com/overtone/emacs-live">emacs-live</a> - <a href="http://orgmode.org/">org-mode</a> - <a href="https://github.com/relevance/org-html-slideshow">org-html-slideshow</a>
</p>
</center>

<script type="text/javascript" src="org-html-slideshow.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Adrian Bendel</p>
<p class="date">Created: 2013-12-10 Di 13:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
